{"0.-Preparation":{"slug":"0.-Preparation","filePath":"0. Preparation.md","title":"0. Preparation","links":[],"tags":[],"content":"Things to get sorted before we go\n\nBikes need to be road registered and licenced beyond the Expedition end date.\nOriginal eNatis certificate is essential to travel with owner / driver.\nClearance certificate from police station – x 3 copies. Every Driver of every motorcycle must list every attachment and tool on the bike even extras such as lights.\nDon’t leave loose things - Tools, GPS etc. on the bikes - bring them with you or place them in a separate bag for transporting.\nGet a clearance certificate from the police that states its not stolen and it belongs to you.\nPrepare an authorization letter confirming a driver can transport it to Namibia for you.\n\nCan the above clearance / letters all be done as one ??\n\n\nIt is up to each bike owner to insure their own bikes and notify their insurer of the trip details.\nMike to confirm bike trailer is insured etc.\nCopies of key documents (passports, ID etc.) to be made.\nMedical Aid to be notified of the trip.\nBikes and documents delivered to TBA on the TBA for loading; with 4 x labelled Tie-down straps (non Chinese - preferably narrow ratchet), Shock protector.\n\n\n\n\n                  \n                  You want to enjoy the whole expedition, right? .... \n                  \n                \n\n\n\n                  \n                  Get your body expedition ready!! ... fitness is very important to ride for 12 days over 1,900kms (that&#039;s like the Dakar, only slower). \n                  \n                \n\nBig difference riding for 3 days and 12 days of focused active riding!!!\nGet your butt seasoned and hands hardened!… Go for multiple long outrides\nGet some time in soft sand - you’ll thank yourself later.\nGet in some technical stuff to build confidence.\n\n\n                  \n                  Injuries and exhaustion will spoil your trip ...  you don&#039;t want to end up in the support vehicle and peddling kitchen and campsite duties!! \n                  \n                \n\n\n\n\nBike preparation\n\n Licenced\n Number plates &amp; Reg discs\n ZA Sticker (??)\n All documents\n Passport\n Garmin mounts\n Tie downs (4)\n Tyres\n Tubes / Mousses / Slimed\n Seals checked replaced\n Chain good\n Radiator check\n Hoses\n Fuel filter / fuel pump\n Bearings checked\n Major service\n Long range tank\n Battery replacement check\n Ride check - Fully loaded with all spares etc.\n …\n\n\nSpares\nVehicle spares\n\n\n                  \n                  Support crew to sort this out ... \n                  \n                \n\nBike spares\n\n\n                  \n                  Andrew to flesh this out ... \n                  \n                \n\n\nTools\nSupport vehicles\n\n\n                  \n                  Support crew to list and arrange ... \n                  \n                \n\nBike tools\n\n\n                  \n                  Andrew to build up this list and arrange \n                  \n                \n\n\nVehicle checklist preparation / loading\n\n Fridges / Freezer\n Extra Batteries\n Solar panel / chargers\n Power extensions\n Multi-plug extensions\n Adapters (?? what types)\n Jackery\n Fuel containers\n Tie downs\n First Aid kit\n Puncture repair\n Tools\n Compressor\n Vehicle Recovery kit\n Water containers\n Supplies (Tinned foods, herbs, spices, )\n Torches\n Chairs\n Stretchers\n Sleeping bags\n Everybody’s camping kit (sleeping bags, casual and riding clothes, toiletries, meds, torch, chargers etc.)\n Rider’s bike bag (backpack, tools, spares, garmin etc.)\n Rider’s riding kit: boots, knee guards, gloves, pants, chest protector, neck brace, helmet &amp; goggles\n Spares (vehicle &amp; bikes)\n Spare helmet, goggles &amp; gloves\n Table\n Cutting board\n Cooking utensils\n Cooking equipment (Pots, knives, ladles, servers, etc.)\n Eating ware (plates, knives, forks, spoons)\n Cups / mugs\n Plastic “glasses”\n Serving dishes\n Booze / Refreshments (decide what should be bought in Nam)\n Braai grid and utensils\n Firelighters\n Cleaning up stuff (Soap, cloths, scrubbers etc.)\n Wash basin\n Clothes line\n Walkie talkies\n Satellite phones\n Fuel bladders\n … and so on\n\n\n\n                  \n                  Barry&#039;s offered his plot for us to Store / Load and do Pre-checks on the vehicles and loading of bikes on the trailer. Will send the location on the WhatsApp group \n                  \n                \n"},"1.-Getting-there":{"slug":"1.-Getting-there","filePath":"1. Getting there.md","title":"1. Getting there","links":[],"tags":[],"content":"A two day cross-country getting the crew, vehicles and riders to Henties bay (1,930kms) - our starting point of the Expedition.\nDay 1 - The support vehicles with the bikes in tow, together with those making their way by road, will have to do the arduous journey into and through Botswana to the Namibian border via the numbing Transkalahari road. Once through the border, the convoy will overnight in Gobabis at the Transkalahari End Resort. Border crossing et al, could be a 15hour day.\nDay 2 - Via Windhoek and Swakopmund to Henties Bay (780kms), stocking up en route for perishables, groceries, drinks, water etc. we’ll need for the next 4-5 days.\n\n\n                  \n                  Some people may fly in to Windhoek or Swakopmund instead of driving. Special arrangements will have to be made in country to to get to dropped off in Henties bay. \n                  \n                \n\n\n\n                  \n                  Chris and Andrew will make their own way from PE to Henties. \n                  \n                \n\n\n\n\nRoute\n\nLink to the Routes\n\nDeparture point (Jhb)\n\nCrack of dawn kickoff … Meet at Sasol Garage off N14 at the bottom of Krugersdorp hill at 5am\n\nBorder duties\nBorder crossing requirements / details\n\n3rd party insurance will be need to be purchased when crossing into Namibia\nThe vehicle transporting the bikes will also need to take out 3rd party insurance for the transporting vehicle &amp; trailer.\nAll insurance referred to above are paid on the Namibia side of the border (Not something that is an additional insurance cover from you SA insurance company)\nThe people taking the bikes across the border is likely to spend some time at the border dealing with with this schlepp. The things going over the border must com back - they want to check everything that was on the bike is still on and hasn’t been sold.\n\nArriving in Namibia\n\nSim card - Cell phone …\n\n\n\nGobabis\nOvernight stop …\n\n\n\n\nWindhoek\nShopping …\n\nSwakopmund\nShopping … (fresh produce?)\n\n\n                  \n                  Bikes, cars containers, canisters must all be filled up - fuel and water! \n                  \n                \n\n\nHenties\n\nFantastic seaside lodging at the # First Group Desert Rose\nWe’re booked in here for the first and last night of our inland expedition.\n\n\n\n\n\n\n\nTrailer stowage\n\n\n                  \n                  Still need to figure out where to store the trailer. \n                  \n                \n"},"2.-Daily-schedule":{"slug":"2.-Daily-schedule","filePath":"2. Daily schedule.md","title":"2. Daily schedule","links":[],"tags":[],"content":"\nWe packed this expedition into two weeks, unfortunately with no rest day. The general aim is to get to the destination by mid afternoon to relax and enjoy the surrounds.\n4 Days (1,2, 14 &amp; 15) are spent travelling to and from Henties bay. The offroad section, which is where the real adventure is, is 12 days!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDayDateWeekdayFromToKm DistanceEst TimeAccomDinner108/08/2026SatJhbGobabis1,15013hLodgeOut209/08/2026SunGobabisHenties6356.5hLodgeOut310/08/2026MonHentiesSpitzkoppe1505hCampIn411/08/2026TueSpitzkoppeBrandberg1554.5hCampIn512/08/2026WedBrandbergPalmwag1905.5hCampOut613/08/2026ThurPalmwagKhowarib1264hLodgeOut714/08/2026FriKhowaribOpuwo1833.5hCampOut815/08/2026SatOpuwoEpupa1834.5hCampOut916/08/2026SunEpupavz Campsite1454.5hCampIn1017/08/2026Monvz CampsiteMarble633.5hCampIn1118/08/2026TueMarblePuros1136hCampIn1219/08/2026WedPurosUngongo1926.5hLodge/CampIn1320/08/2026ThuUngongoTwyfelfontein1973.5hCampIn1421/08/2026FriTwyfelfonteinHenties2336hLodgeOut1522/08/2026SatHentiesGobabis6356.5hLodgeOut1623/08/2026SunGobabisJhb1,15013hOut\n\n\n                  \n                  Estimated times are for the Bikes, excluding unforeseen crap like punctures etc. Vehicle times may differ. A large part of the route is active, meaning you have to focus, but mellow riding. \n                  \n                \n\n\nDaily meal ideas\n\n\n                  \n                  Masterchef Barry to figure this lot out .. \n                  \n                \n\nBreakfast\nTBD\nLunch\nLunch pack: Apple, Snack bars, Liquifruit (Example …)\nDinner\nTBD\n\nDaily thingies\n\n\n                  \n                  Everybody to do their bit ... \n                  \n                \n\n\nCharge devices (helmet intercom), phones\nCheck fuel situation - Top up bike from canisters if necessary\nBike check tyres, oil etc.\nTop up backpack\nGrab a lunch pack\nLube your chain\nPack away own kit and stuff (stretcher, camping chair etc.)\nLoad day’s route\nSync with your riding buddy\nFigure out lunch stops and riding plan for the day\n\n\n"},"20.-Lone-men-of-Namibia":{"slug":"20.-Lone-men-of-Namibia","filePath":"20. Lone men of Namibia.md","title":"20. Lone men of Namibia","links":[],"tags":[],"content":"\n\nThere are super cool stone sculptures placed around the region. These creative works-of-art are perfect for the terrain. They are all postured differently and not always that easy to spot.\nThey are shrouded in mystery regarding their locations and who the artist is.\nI’ve demystified their whereabouts by sourcing their locations and marking their locations in the vicinity of our travels. One still has to spot them considering how well they blend in.\nI think we will pass about 8 of the twenty something men.\n\n\n\n                  \n                  If you want to see the locations I&#039;ve marked, refer to the map and make sure the &quot;StoneMenEnRoute&quot; layer of the map is turned on. \n                  \n                \n\n\nYou should see several “Yellow men” locations on the map.\nClick on the “yellow men” on the map and you should see something like…\n\n\n\n\n                  \n                  Want to a glimpse of what they all look like ? Pictures of the Lone-men of Namibia\n                  \n                \n\n\n"},"29.-Major-river-sections--and--crossings":{"slug":"29.-Major-river-sections--and--crossings","filePath":"29. Major river sections & crossings.md","title":"29. Major river sections & crossings","links":[],"tags":[],"content":"\n\n                  \n                  Because we’ll be travelling on two wheels with support vehicles, crossing and travelling in several rivers, having up-to-date information on river levels and flow / flood risk is very important. \n                  \n                \n\nWe have mapped out all the sections where the major rivers are part of our route. We will utilise local resources to inform us in on the conditions, where possible.\n\nHuab river\nUmaruru rirver\nHoarusib river\nHoanib river\nUgab\n\n\nNorth western major river systems\n\n\nUmaruru river\nDay 1 &amp; 2 - Lengthy sections\n\n\nUgab river crossing\nDay 3 - Crossing the Ugab river when leaving White Lady\n\nHoarusib &amp; Hoanib rivers\nDay 9 Marble to Puros - second half - Hoarusib (only 20kms)\n\nD9a &amp; b - Alternate routes - Hoarusib (Approx. 10kms)\n\nIntermittent stream joining up with Hoarusib river\n\n\nDay 10 Puros to Ongongo - Frist section through the Purros canyon &amp; Second half\n\n\nHuab\nDay 11 - Crossing\n\n\nUgab river\nDay 12 - Short section  (2kms)\n\n\n\n\n                  \n                  We&#039;ve picked August for two reasons - more temperate heat during the day and out of the rainy season. Chances of rain based on historical statistics is estimated to be around 6%. \n                  \n                \n\nWe will do a rain check before we depart and if rain is predicted, we’ll adapt as much and as best as possible.\n\n"},"3.-Day-1---Henties-to-Spitzkoppe":{"slug":"3.-Day-1---Henties-to-Spitzkoppe","filePath":"3. Day 1 - Henties to Spitzkoppe.md","title":"3. Day 1 - Henties to Spitzkoppe","links":[],"tags":[],"content":"Up the Umaruru river\n\nWe will confirm the conditions of the riverbeds prior to doing this and other sections of the route, but assuming conditions are good, we’ll travel about 80kms inside the Umaruru riverbed, hang right and head down to Spitzkoppe. There is a good chance the support vehicles can follow on the same route. If not, there is an alternate route available, but super corrugated, I’m told.\nWe will leave at first light to give us as much time as possible to enjoy the route and to get to Spitzkoppe early as possible - to enjoy this magical place.\n\n\n\n\n                  \n                  Picture yourself .... throttle twisted wide open ... wide open sand coming at you ... yeah baby! \n                  \n                \n\n\n\nCool footage\n1 - Barbara &amp; Johan riding up the Umaruru 690 &amp; 701 \n2 - Cool zen video … Vehicles upriver - 3 Years ago\n3 - If you’re not careful … Exploring the Omaruru River\n4 - Cool details … Stpizkoppe then Umaruru (Reverse)\n\nSpitzkoppe\n\nThe Spitzkoppe is a group of bald granite peaks or inselbergs. The sheer size with voluptuous curves makes this cluster formation so intriguing. The granite is more than 120 million years old and the highest outcrop rises about 1,728 metres above sea level. The peaks stand out dramatically from the flat surrounding plains.\n\n\n\nThey have great expansive campsites! There are nice outdoor showers at reception and ablutions spread around. We will have all we need so we were good to camp and have fun riding / driving around.\n\n\n\n\n                  \n                  There are open fire pits. Ons gaan lekker BRAAI! \n                  \n                \n\n\nFirst night sleeping under the stars … No need to bunch up - snorers can run wide here. \n\n\n\nBeautiful view of the night sky (Milky Way clearly visible!) …  so clear you can see tomorrow coming …\n\n\n\n\n                  \n                  If you&#039;re an insomniac like Rainer, you can dissolve your worldly thoughts into the deep overloaded night sky. \n                  \n                \n\n\n\nRefuelling\n\n\n                  \n                    No fuel station around - The next refuel spot is Uis (approx. 135kms). We will have travelled about 150kms, making the refuel point about 285kms\n                  \n                \n\n\n\n                  \n                  Bikes with ranges &lt; 320kms should add a few litres from the Jerry cans, or carry a fuel 5l bladder, as a safety margin. \n                  \n                \n\n\n"},"30.-Latest-Country-Information":{"slug":"30.-Latest-Country-Information","filePath":"30. Latest Country Information.md","title":"30. Latest Country Information","links":[],"tags":[],"content":"Umaruru river\n2025 Video - High levels"},"31.-The-River-system-in-Namibia":{"slug":"31.-The-River-system-in-Namibia","filePath":"31. The River system in Namibia.md","title":"31. The River system in Namibia","links":[],"tags":[],"content":"\nNamibia Rivers Map — a general country-wide map showing rivers, major waterways and their courses. This map gives a broad orientation of where major and smaller rivers flow across Namibia.\n\nNamibia Rivers Map\n\n\nIn-depth study - report on the water resources\n"},"4.-Day-2---Spitzkoppe-to-Brandberg":{"slug":"4.-Day-2---Spitzkoppe-to-Brandberg","filePath":"4. Day 2 - Spitzkoppe to Brandberg.md","title":"4. Day 2 - Spitzkoppe to Brandberg","links":[],"tags":[],"content":"Back up to the Umaruru river, Uis &amp; White Lady\n\n\nWe head back up to the Umaruru river on a different route. Do about 25kms of riverbed then head to UIS for refuelling and some refreshments.\n\n\n\nRefuelling in Uis\n\nWe will have travelled about 285kms since the start (Henties) so refuelling is essential. It may be prudent for those with shorter fuel range  (i.e. below 300kms) to add some fuel from the storage. As a general rule … if there’s fuel, fill up.\n\n\n\nLooks like a nice spot to quench the thirst (Brandberg White Lady Cafe)\n\n\n\nFrom Uis to Brandberg (White Lady Camp site) is about 35kms further.\n\n\nArriving at the White Lady Campsite\n\nThis campsite is nice and open with hot water and braai facilities.\n\n\n\nAfter the first night, the snorers are tagged … Plenty of space to avoid them …\n\n\n\nBrandberg as seen from above … If we had more time it would have been nice to loop around it\n\n\n\nView of the campsite from the hill above the lodge …\n\n\n\n\n                  \n                  .... Great place to have sundowners ... \n                  \n                \n\n\n\n\n                  \n                  There is a restaurant, if preferable ... \n                  \n                \n\n\n\n\n                  \n                  This is the way to end the day... \n                  \n                \n\n\n\nRefuelling\n\n\n                  \n                  No fuel station!  - No worries ... next Fuel Stop +/- 190kms (Palmwag). Distance since last refuel 35kms (225kms)\n                  \n                \n"},"5.-Day-3---Brandberg-to-Palmwag":{"slug":"5.-Day-3---Brandberg-to-Palmwag","filePath":"5. Day 3 - Brandberg to Palmwag.md","title":"5. Day 3 - Brandberg to Palmwag","links":[],"tags":[],"content":"\nA 190km of mixed riding.\n\n\n\nThe first 65kms is a mix of rocky and some of the Goantagab riverbed at the Red Mountain Joint Management Area (up to the C39).\n\n\n\n\n\n                  \n                  Google maps and even Google earth makes things looks so flat ..... \n                  \n                \n\nCool footage\n1 - Barbara &amp; Johan riding from Brandberg on a 690/701 \n2 - A cool biking video that’s a bit long, but gives a good idea of the terrain seemingly after some prior rains - early 2025 - Route ridden top down\n\nOrgan Pipes\n\nFormed as molten lava intruded into older rock (slate/shale), then cooled and contracted, fracturing in such a regular, polygonal pattern. Estimated to be around 130–150 million years old, making it a relic of ancient volcanic activity in the region. Over time, erosion exposed these basalt/dolerite columns, creating the dramatic “organ-pipe” effect - The result is striking: a natural “cathedral” of stone, often described as one of the more spectacular examples of basalt columnar jointing in southern Africa — a kind of geological monument to Earth’s volcanic past.\n\n\n\n                  \n                  Fee around R250 / NAM$. The visit is short —  10–15 minutes ! \n                  \n                \n\n\n\nPitstop at Twyfelfontein lodge\n\n\n                  \n                  Will have earned the  coming up ... Follow this lady if you&#039;re thirsty\n                  \n                \n\n\n\n\n                  \n                  Best bar in the wilderness !! \n                  \n                \n\n\n\nNext stop Palmwag Lodge / Campsite\nCamp vibes\n\nLuxury camping and Eating out!!!\n\n\n\n\n\n\nAccommodation is structured tents, each equipped with 4 single beds, an en-suite bathroom with a shower, and a kitchen equipped with a fridge, stove, sink, necessary cooking utensils, and cutlery. In addition to this, there is an outside braai as well as a fire pit to gather round and enjoy the Namibian night sky.\n\n\nRefuelling\n\n\n                  \n                    Refuel at Palmwag! Next Fuel Stop +/- 150kms (Sesfontein)\n                  \n                \n\n"},"6.-Day-4---Palmwag-to-Khowarib":{"slug":"6.-Day-4---Palmwag-to-Khowarib","filePath":"6. Day 4 - Palmwag to Khowarib.md","title":"6. Day 4 - Palmwag to Khowarib","links":[],"tags":[],"content":"\n126kms of really diverse and exciting riding - everything from hilly, rocky to hardpack, sandy and even fesh-fesh. Fantastic scenery going through the Klein Serengeti and the Khowarib Schlucht.\n\n\n\nWe head up the D3706 gravel road for about 50kms, turn right into this 70km section of some amazing wilderness riding. There have been lions spotted, apparently escapees from Etosha, but I’m told if we travel together there won’t be a problem.\n\n\n\nCool footage\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                  \n                  Martin Malec: # Kaokoland 2018 Day 2 \n                  \n                \n\n\nVideo footage\nClearly this route’s ease of passage is dependent on past rainfall and current lion activity  …\n1 - Scrumming - wet conditions \n\n\n                  \n                  The plan was to ride 70km up the Hoanib River but 15km in we turned around because someone thought it would be funny to broadcast some fake news about lions in the river \n                  \n                \n\n2 -When its dry - very different … Excuse the commentary\n\nPitstop … somewhere in the Schlucht\n\n\n                  \n                  If the conditions are favourable and the vehicles join we will have ... \n                  \n                \n\n\nNext stop Khowarib Lodge (Self catering tents)\nCamp vibes\n\nThe en-suite tents are a short walk from the lodge to the river bank and either have a double or twin beds. Viewing platforms extend from the front of each tent, shaded by the plentiful mopani trees but affording splendid views of the gorge. The open-air bathrooms are spacious and well equipped, adding to the feeling of indulgence and relaxation that Khowarib Lodge offers.\n\n\n\n\n\n\nLodge features an outdoor swimming pool, garden, a terrace and restaurant and a bar. All rooms come with a patio.\nThe self-catering units consist of two ¾ beds with bedding and towels. A fan is available to cool down on hot days. The self-catering units are made from canvas and have a porch area in front with a table, four chairs and a mini kitchenette. An en-suite bathroom with a shower, washbasin, and toilet is included. Each self-catering unit has a braai (barbecue).\nGuests are welcome to use the swimming pool, bar and restaurant at the nearby campsite.\n\n\nDinner plans\n\n\n                  \n                  It&#039;s optional to eat at the restaurant (by prior arrangement) \n                  \n                \n\n\nRefuelling\n\n\n                  \n                    - After packing up camp we&#039;ll all travel about 35kms to Sessfontein to refuel. The next Fuel Stop is  +/- 150kms (Opuwo)\n                  \n                \n"},"Index":{"slug":"Index","filePath":"Index.md","title":"Index","links":["0.-Preparation","1.-Getting-there","2.-Daily-schedule","3.-Day-1---Henties-to-Spitzkoppe","4.-Day-2---Spitzkoppe-to-Brandberg","5.-Day-3---Palmwag","6.-Day-4---Palmwag-to-Khowarib","20.-Lone-men-of-Namibia","29.-Major-river-sections--and--crossings","30.-Latest-Country-Information","31.-The-River-system-in-Namibia"],"tags":[],"content":"Namibia 2026 Expedition\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCONTENTS0. Preparation1. Getting there2. Daily schedule3. Day 1 - Henties to Spitzkoppe4. Day 2 - Spitzkoppe to Brandberg5. Day 3 - Palmwag6. Day 4 - Palmwag to Khowarib20. Lone men of NamibiaVetenary constraints and considerations29. Major river sections &amp; crossings30. Latest Country Information31. The River system in Namibia\n\nSummary of the Expedition\n\nThis Expedition will take us through some of the most geographically diverse and sparsely occupied terrain in Namibia … Damaraland and Kaokoland (the Erongo and Kunene regions); we’ll be riding through and seeing some unusual landmarks like Spitzkoppe, Brandberg, Epupa Falls, Van Zyl’s pass, the Marienfluss, Purros Canyon, Kowharib Schlucht, Desolation valley and a bunch more. The best part for bikers … you will be witnessing changing conditions right under you feet every day.\nWhile the terrain is often rough, we’ve opted for a mix of roughing it in the open and the occasional luxury lodging.  Unlike some solo travellers without support, we’ve opted to go for a little more comfort and piece of mind, making travelling lighter and agile to enjoy the time in the saddle and hopefully less fatigue in the sandy, fesh-fesh and rocky conditions. We will be supported by three vehicles who will bring along all the goodies to complete the safety, camping, catering and backup facilities we’ll need.\n\n\nMap and routes\n\n\n                  \n                  Info\n                  \n                \n\nHere are the Routes\nTracks4Africa Map - A good place to look around\n\n\n                  \n                  Something we have to keep in mind is the weather conditions prior to our trip, and forecast during our trip, that could influence the routes, as well as  vetenary and border regulations.\n                  \n                \n\n\n\nThe inland section of the Expedition.\n\n\nWe will travel 1,930kms over 12 days. It is a true dual sport adventure in one of the most beautiful and fascinating places on earth. One needs a  degree of sand and technical riding skill and experience covering some sand and rocky mountain passes during the trip. Fitness will play an important role as fatigue is likely to creep in at some point.\nWe will trailer all the bikes together, into and out of Namibia. At the appropriate time we will indicate where and when to deliver your bikes and all the mandatory documentation - of which there is a crap load.\nThis expedition is not to make money and is therefore on a cost covering basis. We have limited this to 10 riders, all contributing equally to the costs. We will arrange, where possible spares etc. on a return basis.\n\n\nAcknowledgements\n\n\n                  \n                  Note\n                  \n                \n\nGratitude to Barbara Muzinski for providing invaluable guidance helping us plan this expedition, having done parts of this trip back in 2019 with Johan, but without support vehicles .\nShout out to Martin Malec and Hardy de Kock, who also shared important  information having travelled these parts on many occasions.\n\n\n\nThis expedition includes:\n\nAll the accommodation in Namibia (mostly camping)\nBring your own Stretcher, sleeping bag &amp; camping chair\nAll cutlery, crockery, cooking utilities &amp; equipment\nBreakfast, lunch packs &amp; dinner (eating out where available)\nFresh water and refreshments\nFridge / Freezer - Ice when available\nBackup and recovery vehicles\nMedical support / First-aid kit and assistance from George &amp; Andrew\nAerial evacuation arrangements with an Evacuation Company. ???\nBackup  fuel for bikes in areas where no fuel is available. We’ll all fill wherever possible. (budget around R2000/pp)\nTracks / Routes to upload to your GPS.\nGeneral Tools. (Note: Each biker / biker pair to carry own basic tools and tyre repair).\nTyre Air Compressor.\nPuncture repair equipment.\nLimited bike spares and accessories.\n2 X Satellite phones (For emergencies in the remote areas, where there is no Cell / Wi-Fi)\nWalkie talkies for Support vehicles &amp; Sweeper. Riders recommended to use intercom system.\n\n\nRegional map\n\nSome arb information about the region …\nErongo Region\nErongo Region\nThis region comprises the Swakopmund magisterial district up to the Ugab river and includes the enclave of Walvis Bay, former Damaraland south of the Ugab river, and the Omaruru and Karibib magisterial districts. The region comprises of six constituencies: Omaruru, Karibib, Brandberg, Arandis, Swakopmund, Walvis Bay.\nThis region is named after the Erongo mountain, a well known landmark in Namibia and in this area. All the main centres within this region, excepting south of former Damaraland, are connected by tarred roads. Gravel roads link this this part with either Omaruru or Swakopmund.\nThe inclusion of former South Damaraland is necessitated by various services for this part which originate in Omaruru. Postal and telecommunications services for Omatjette, Okombahe and Uis are maintained from Omaruru. Veterinary services for these areas are provided by the State Veterinarian based at Omaruru.\nThe Omaruru, Karibib and Okombahe/Uis/Tsubeses areas are all situated in a semi-arid farming region and have a homogenous farming pattern, which is mostly stock-raising. It also combines communal farming with commercial farming.\nVarious mining operations occur within this region at places such as  Navachab\nand on a smaller scale at places surrounding Uis and the desert area.\n\n\n                  \n                  Info\n                  \n                \n\nFacilities such as hospitals and clinics, the supply of electricity and telecommunication services are, with a few exceptions, well established.\nMedical services are rendered at the clinics of Omatjette, Okombahe, and Uis by medical personnel and private doctors stationed at Omaruru. The main hospital centre for this area is in Omaruru.\n\n\n\nKunene Region\nKunene Region\nThis region comprises the western part of former Ovambo, Koakoland, Damaraland north of the Ugab river and the Magisterial District of Outjo. The region has been divided into the following six constituencies: Ruacana, Opuwo, Sesfontein, Khorixas, Kamanjab and Outjo.\nThis region is named after the Kunene river which forms the north-western border of this particular region. With its large supply of water and its hydro-electric plant, this river will play an increasingly important role in Namibia. \nAt its main centres, the region has facilities such as clinics and hospitals and electrical power supply.\n\n\n\n                  \n                  This site and information has been built for our Expedition group exclusively, please refrain from sharing outside this group. \n                  \n                \n"},"attachments/21.-Test":{"slug":"attachments/21.-Test","filePath":"attachments/21. Test.md","title":"21. Test","links":[],"tags":[],"content":"Martin’s days -\nEnd of day 2 they ended up at Ogongo waterfall\n1 - UIS to Palmwag\n\n2 - Palmwag to Khowarib\n\n7 - Van Zyl’s descent"}}